<a href="https://colab.research.google.com/github/Rice-from-data/DS-Unit-1-Sprint-1-Dealing-With-Data/blob/master/Ned%20Horsey%20Repl%203-20-19.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This coding challenge will walk you through the basics of Python 3 and Pandas library. 

Repl.it uses automatic unit tests to determine the correctness of your answer. On the left hand side you see the IDE and the console output windows. You execute your code by pressing the RUN button - you can do this as many times as you like. 

When you're ready, move on to the NEXT button to check your answers against the unit tests and submit your work for grading. Please make sure to submit your work (even if incomplete) before 8:45 PST so we can take attendance. Have fun!


Task 1: 
Your first task is to import the Pandas library, as we must install libraries (also called packages or modules) that support the functionality we need (in this case loading datasets in various formats). Remember the "iconic trio"?

Good detailed resource here: https://www.digitalocean.com/community/tutorials/how-to-import-modules-in-python-3


Task 2:
The second task is to load different file types for further processing and print out the first 5 rows. You will soon find that in data science, your datasets will come in various shapes and forms. Very frequently we use the .CSV (comma-separated values) format, however there are many others. 

Now let's test out loading and displaying a few different types in data. Load these three datasets and display the first five rows for each.

Hint: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html

Dataset 1: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/BlackFriday.csv

Dataset 2: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/PeopleInSpaceNow.json

Dataset 3: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/FastFmProfiles.tsv

In [1]:
# Task 1 - Pandas Library Import here: 
import pandas as pd

# Task 2 - Load three datasets and display 5 rows of data for each dataset:
bf_df = pd.read_csv('https://raw.githubusercontent.com/pierretd/datasets-1/master/BlackFriday.csv')
bf_df.head()


# Stretch Goal/Super Stretch Goal: Insert Colab Link here. Make sure it is a comment.

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [4]:
pis_df = pd.read_json('https://raw.githubusercontent.com/pierretd/datasets-1/master/PeopleInSpaceNow.json')
pis_df.head(n=5)

   message  number                                             people
0  success       3       {'name': 'Sergey Prokopyev', 'craft': 'ISS'}
1  success       3        {'name': 'Alexander Gerst', 'craft': 'ISS'}
2  success       3  {'name': 'Serena Aunon-Chancellor', 'craft': '...

In [8]:
ffp_df = pd.read_table('https://raw.githubusercontent.com/pierretd/datasets-1/master/FastFmProfiles.tsv')
ffp_df.head()

           #id gender   age        country    registered
0  user_000001      m   NaN          Japan  Aug 13, 2006
1  user_000002      f   NaN           Peru  Feb 24, 2006
2  user_000003      m  22.0  United States  Oct 30, 2005
3  user_000004      f   NaN            NaN  Apr 26, 2006
4  user_000005      m   NaN       Bulgaria  Jun 29, 2006

Stretch Goals: 
Load Dataset 1 into a Colab notebook and answer the following questions. When you are finished, add a link to your Colab notebook to the top of the code challenge as a comment.

1) Clean the data set and drop the Null/NaN values. Rename  Product_Category_1-3 columns with an actual Product.

In [14]:
print(bf_df.isna().sum())
print(bf_df.shape)
bf_df.dtypes

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64
(537577, 12)

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [17]:
bf_masked = bf_df.dropna()
bf_masked.isna().sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Purchase                      0
dtype: int64

In [20]:
bf_renamed = bf_masked.rename(columns={'Product_Category_1': 'Toothbrush', 'Product_Category_2': 'Hairbrush', 'Product_Category_3': 'Dogbrush'})

list(bf_renamed)

['User_ID',
 'Product_ID',
 'Gender',
 'Age',
 'Occupation',
 'City_Category',
 'Stay_In_Current_City_Years',
 'Marital_Status',
 'Toothbrush',
 'Hairbrush',
 'Dogbrush',
 'Purchase']

2) How many unique user_ids does the data set contain?

In [26]:
bf_renamed.User_ID.unique().size

5868

3) How many unique age brackets are in the dataset. Which Age bracket has the most entries? Which has the least?

In [33]:
bf_renamed.Age.unique().size
# 7 age brackets

bf_renamed.groupby('Age')['User_ID'].nunique()

# So 26-35 has the most
# 0-17 the least

Age
0-17      216
18-25    1068
26-35    2045
36-45    1166
46-50     526
51-55     479
55+       368
Name: User_ID, dtype: int64


4) Transform the Gender categorical variable into a numerical variable. Then transform that numerical value into a Boolean.

5)What is the average Occupation score? What is the Standard Deviation? What is the maximum and minimum value?

In [42]:
# bf_renamed.Gender
# So I'll replace F = 1 and M = 0

bf_gender = bf_renamed.replace(['F','M'], [1,0])

# bf_gender.dtypes
# bf_gender.Gender
# replace worked

bf_boolean = bf_gender.Gender.astype('bool')

# bf_boolean.dtypes

User_ID                         int64
Product_ID                     object
Gender                          int64
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Toothbrush                      int64
Hairbrush                     float64
Dogbrush                      float64
Purchase                        int64
dtype: object